## Data Frame Methods

--1.index()- this method returns index (row labels) of the data frame.

--2. add()- This method returns addition of dataframe and other

--3. sub()- This method returns substraction of dataframe and other

--4. mul()- This method returns Multiplication of dataframe and other

--5. div()- This method returns floating division of dataframe and other
         
--6. unique() - This method extract the unique values in the dataframe

--7.nunique()- This method returns count of unique values in the dataframe

--8.value_counts() - This method counts the number of times each unique value occurs within the series

--9. axes() -list representing the axes of the dataframe

--10.between() - This  method extracts rows where a column value falls in between a predefined range 

--11.isin()-This method extracts rows from a dataframe where a column value exist in a predefine collection

--12.dtypes()-This method return series with the data type of each column

--13.astype()- This Method convert the data type in series

--14.sort_values() -This method sorts the dataframe in ascending or descending order

--15.sort_index()- This method sorts the value in a dataframe based on their index position or labels instead of their values

--16. .loc[]- This method retrieves rows based on index labels

--17. .iloc[]- This method retrieves rows based on index position

--18.ix[]-this method retrieves dataframe rows based on either index labels or index position.this method combines best features of the .loc[] and .iloc[] method.

--19.rename()-this method is call on a dataframe to change the names  of the index labels or column names.

--20.drop() and pop()-these methods are used to delete rows or columns from a dataframe.

--21.sample()-this method pulls out random sample of rows or column of a dataframe

--22.nsmallest()-this method pulls out a rows with the smallest values in a column

--23.nlargest()-this method pulls out a row with the largest values in a column

--24. shape()-this method returns a tuple representing the dimensionality of the data frame

--25.ndim()-it returns "int" representing a number of axes/array_dimension

--26.copy()-methods create independent copies of pandas object

--27.duplicated()-this method create boolean series and uses it to extract rows that have duplicate values

--28.drop_duplicates()-to identify the duplicate rows and removing them through filtering

--29.set_index()-this method sets the dataframe index (row labels) using one or more existing columns

--30.reset_index()-this method resets index of a dataframe.this method sets the list of integer ranging from zero to length of data as index.

# parameters 

--1. inplace-if it is true it fill values at an empty place otherwise false (inplace=True, inplace=False)


# Functions

--1.apply()- This function allows the users to pass a function and apply it to every single value of pandas

Syntax  -    

          
          DataFrame.apply(func, axis=0, broadcast=None, raw=False, reduce=None, result_type=None, args=(), **kwds)
          
   Parameter description-
   
      1.func- it is a function that is to be applied to each column or row 
        
      2.axis -(0 or index, 1 or columns default value will be zero). 
      it is an axis along which the function is applied.it can have two values,
      0 or index-it applies the function to each of the column 
      1 or column-it applies the function to each of the row
      
      3.broadcast - it is an optional parameter which returns the boolean values.only relevant for aggregation functions:
        False  or None: it returns a series whose length will be length of index
        True: results will be broadcasted to the frame
        
      4. raw-bool,default value False(False : it passes each row or column as series  to the function, True:the passed function will received ndarray object) 
        
      5.reduce- default value is none
      
      6.result_type - default value is none
      
      7.args()- it is a positional arguments
      
      8.**kwds- it is an optional keywords arguments

## Slicing, indexing,manupulating and cleaning pandas dataframes

In [5]:
##slicing rows
import pandas as pd 
#initializing the nested list with dataset
player_list=[["dhoni",36,75,55000000],
             ["messi",34,69,100000000],
            ["nadal",32,75,75000000],
            ["serena",34,78,8000000
            ]]
#Creating pandas dataframe
df=pd.DataFrame(player_list,columns=["name","age","weight","salary"])
print(df)

     name  age  weight     salary
0   dhoni   36      75   55000000
1   messi   34      69  100000000
2   nadal   32      75   75000000
3  serena   34      78    8000000

In [8]:
#slicing rows in dataframe 
df1=df.iloc[0:2]
df1

    name  age  weight     salary
0  dhoni   36      75   55000000
1  messi   34      69  100000000

In [9]:
#Slicing Columns by using iloc
df1=df.iloc[:,0:2]
df1

     name  age
0   dhoni   36
1   messi   34
2   nadal   32
3  serena   34

In [10]:
#indexing panda dataframe
import pandas as pd 

player_list=[["dhoni",36,75,55000000],
             ["messi",34,69,100000000],
            ["nadal",32,75,75000000],
            ["serena",34,78,8000000 ]]
#Creating pandas dataframe
df=pd.DataFrame(player_list,columns=["name","age","weight","salary"],index=['a','b','c','d']) ## indexing
print(df)

     name  age  weight     salary
a   dhoni   36      75   55000000
b   messi   34      69  100000000
c   nadal   32      75   75000000
d  serena   34      78    8000000

## manuplating pandas dataframe

- manuplation of data can be done in multiple ways like applying functions,changing a data type of columns,spliting,adding rows to a dataframe

In [15]:
# applying lambda function to a column using dataframe.assign()
import pandas as pd
#creating and initializing a list
values=[["rohan",454],
        ["Mohan",425],
       ["Shweta",320],
       ["mohini",487],
       ["akash",257],
       ["Swara",489]]

#Creating pandas dataframe
df=pd.DataFrame(values,columns=['name','univ_marks'])
df

#appplying lambda function to find percentage of univ_marks column using df.assign
df=df.assign(percentage=lambda x:(x['univ_marks'] / 500 * 100))
df

     name  univ_marks  percentage
0   rohan         454        90.8
1   Mohan         425        85.0
2  Shweta         320        64.0
3  mohini         487        97.4
4   akash         257        51.4
5   Swara         489        97.8

In [16]:
##sorting the dataframe in ascending order

import pandas as pd 
#initializing the nested list with dataset
player_list=[["dhoni",36,75,55000000],
             ["messi",34,69,100000000],
            ["nadal",32,75,75000000],
            ["serena",34,78,8000000
            ]]
#Creating pandas dataframe
df=pd.DataFrame(player_list,columns=["name","age","weight","salary"])
print(df)

# sorting by column weight
df.sort_values(by=['weight'])

     name  age  weight     salary
0   dhoni   36      75   55000000
1   messi   34      69  100000000
2   nadal   32      75   75000000
3  serena   34      78    8000000

     name  age  weight     salary
1   messi   34      69  100000000
0   dhoni   36      75   55000000
2   nadal   32      75   75000000
3  serena   34      78    8000000

In [23]:
##sorting the dataframe in descending order

import pandas as pd 
#initializing the nested list with dataset
player_list=[["dhoni",36,75,55000000],
             ["messi",34,69,100000000],
            ["nadal",32,75,75000000],
            ["serena",34,78,8000000
            ]]
#Creating pandas dataframe
df=pd.DataFrame(player_list,columns=["name","age","weight","salary"])
print(df)

# sorting by column weight
df.sort_values(ascending=False ,by=['weight'])

     name  age  weight     salary
0   dhoni   36      75   55000000
1   messi   34      69  100000000
2   nadal   32      75   75000000
3  serena   34      78    8000000

     name  age  weight     salary
3  serena   34      78    8000000
0   dhoni   36      75   55000000
2   nadal   32      75   75000000
1   messi   34      69  100000000

In [3]:
# Cleaning pandas dataframe

import pandas as pd 
import numpy as np
player_list=[["dhoni",np.nan,75,55000000],
             ["zidan",44,69,100000000],
            ["nadal",np.nan,75,75000000],
            ["serena",34,78,7541254 ]]
#Creating pandas dataframe
df=pd.DataFrame(player_list,columns=["name","age","weight","salary"]) ## indexing
print(df)

     name   age  weight     salary
0   dhoni   NaN      75   55000000
1   zidan  44.0      69  100000000
2   nadal   NaN      75   75000000
3  serena  34.0      78    7541254

In [4]:
df=df.dropna()
df

     name   age  weight     salary
1   zidan  44.0      69  100000000
3  serena  34.0      78    7541254

In [39]:
#checking for missing values
df.isnull().sum()

name      1
age       2
weight    0
salary    1
dtype: int64

In [34]:
df.count()

name      3
age       2
weight    4
salary    3
dtype: int64